import Mathlib.Basic.Real.Basic
import Mathlib.Tactic.NormNum

namespace OAI

noncomputable section
namespace InternalCatalan.Case2PointData

def X0 : ℚ := (-2400277287 / 2500000000)

def X1 : ℚ := (-2235579393 / 2500000000)

def X2 : ℚ := (-7608305633 / 10000000000)

def X3 : ℚ := (-3251697397 / 5000000000)

def X4 : ℚ := (-1037172813 / 2000000000)

def X5 : ℚ := (-2007817079 / 5000000000)

def X6 : ℚ := (-1554403323 / 5000000000)

def X7 : ℚ := (-1033960913 / 5000000000)

def X8 : ℚ := (-198731187 / 1250000000)

def X9 : ℚ := (765974031 / 5000000000)

def X10 : ℚ := (2072448179 / 10000000000)

def X11 : ℚ := (802046621 / 2500000000)

def X12 : ℚ := (4381119427 / 10000000000)

def X13 : ℚ := (5851354199 / 10000000000)

def X14 : ℚ := (7269030693 / 10000000000)

def X15 : ℚ := (4195138701 / 5000000000)

def X16 : ℚ := (2333153641 / 2500000000)

def X17 : ℚ := (9709786219 / 10000000000)

def X18 : ℚ := (-1)

def Y0 : ℚ := (88201401 / 5000000000)

def Y1 : ℚ := (165324703 / 5000000000)

def Y2 : ℚ := (382476441 / 5000000000)

def Y3 : ℚ := (1227250753 / 10000000000)

def Y4 : ℚ := (1074732999 / 5000000000)

def Y5 : ℚ := (381023639 / 1250000000)

def Y6 : ℚ := (540337387 / 1250000000)

def Y7 : ℚ := (2782378997 / 5000000000)

def Y8 : ℚ := (6801929373 / 10000000000)

def Y9 : ℚ := (8031988371 / 10000000000)

def Y10 : ℚ := (8877037851 / 10000000000)

def Y11 : ℚ := (1197220229 / 1250000000)

def Y12 : ℚ := (9838463999 / 10000000000)

def Y13 : ℚ := (1994545563 / 2000000000)

def Y14 : ℚ := (2498009299 / 2500000000)

def Y15 : ℚ := (1 / 4)

def Y16 : ℚ := (1 / 2)

def Y17 : ℚ := (3 / 4)

def XPoints : List ℚ :=
  [X0, X1, X2, X3, X4, X5, X6, X7, X8, X9, X10, X11, X12, X13, X14, X15, X16, X17, X18]

theorem X_points_domain : ∀ x ∈ XPoints, (-1 ≤ x ∧ x < 1 ∧ x ≠ 0) := by
  norm_num [XPoints, X0, X1, X2, X3, X4, X5, X6, X7, X8, X9, X10, X11, X12, X13, X14, X15, X16, X17, X18]

def YPoints : List ℚ :=
  [Y0, Y1, Y2, Y3, Y4, Y5, Y6, Y7, Y8, Y9, Y10, Y11, Y12, Y13, Y14, Y15, Y16, Y17]

theorem Y_points_domain : ∀ x ∈ YPoints, (0 < x ∧ x < 1) := by
  norm_num [YPoints, Y0, Y1, Y2, Y3, Y4, Y5, Y6, Y7, Y8, Y9, Y10, Y11, Y12, Y13, Y14, Y15, Y16, Y17]

end InternalCatalan.Case2PointData

end

end OAI
